In [2]:
import pandas as pd

In [3]:
data_raw = pd.read_csv("../data/00-raw/titanic_data.csv")

In [4]:
data_raw.head()

,passenger class,survived,name,AGE,Siblings/Spouses Aboard,par&ch,ticket,fare,cabin Number,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",29.0000,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",0.9167,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",2.0000,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",30.0000,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",25.0000,1,2,113781,151.5500,C22 C26,S